Revit 2026 API

# LoadNatureCreate Method

---

Creates a new LoadNature.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LoadNature Create(
	Document document,
	string name
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String
) As LoadNature
```
```cpp
public:
static LoadNature^ Create(
	Document^ document,
	String^ name
)
```
```fsharp
static member Create :
        document : Document *
        name : string -> LoadNature
```

#### Parameters

document Document
     The Document to which new load nature element will be added.
name String
     The name of the load nature.

#### Return Value

LoadNature The newly created load nature element if successful,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given name is not unique |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LoadNature Class

Autodesk.Revit.DB.Structure Namespace